Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEdsadc_reg.h
/** \brief 7A0, Carrier Generator Synchronization Reg. 6 */
#define EDSADC_CH6_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00247A0u)
/** Alias (User Manual Name) for EDSADC_CH6_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH6_CGSYNC.
*/
#define EDSADC_CGSYNC6 (EDSADC_CH6_CGSYNC)

/** \brief 7A8, Rectification Configuration Register 6 */
#define EDSADC_CH6_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00247A8u)
/** Alias (User Manual Name) for EDSADC_CH6_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH6_RECTCFG.
*/
#define EDSADC_RECTCFG6 (EDSADC_CH6_RECTCFG)

/** \brief 7B0, Common Mode Voltage Register 6 */
#define EDSADC_CH6_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00247B0u)
/** Alias (User Manual Name) for EDSADC_CH6_VCM.
* To use register names with standard convension, please use EDSADC_CH6_VCM.
*/
#define EDSADC_VCM6 (EDSADC_CH6_VCM)

/** \brief 800, Modulator Configuration Register 7 */
#define EDSADC_CH7_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024800u)
/** Alias (User Manual Name) for EDSADC_CH7_MODCFG.
* To use register names with standard convension, please use EDSADC_CH7_MODCFG.
*/
#define EDSADC_MODCFG7 (EDSADC_CH7_MODCFG)

/** \brief 808, Demodulator Input Config. Register 7 */
#define EDSADC_CH7_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024808u)
/** Alias (User Manual Name) for EDSADC_CH7_DICFG.
* To use register names with standard convension, please use EDSADC_CH7_DICFG.
*/
#define EDSADC_DICFG7 (EDSADC_CH7_DICFG)

/** \brief 810, Filter Configuration Register 7, Main */
#define EDSADC_CH7_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024810u)
/** Alias (User Manual Name) for EDSADC_CH7_FCFGM.
* To use register names with standard convension, please use EDSADC_CH7_FCFGM.
*/
#define EDSADC_FCFGM7 (EDSADC_CH7_FCFGM)

/** \brief 814, Filter Configuration Register 7, CIC Filter */
#define EDSADC_CH7_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024814u)
/** Alias (User Manual Name) for EDSADC_CH7_FCFGC.
* To use register names with standard convension, please use EDSADC_CH7_FCFGC.
*/
#define EDSADC_FCFGC7 (EDSADC_CH7_FCFGC)

/** \brief 818, Filter Counter Register 7, CIC Filter */
#define EDSADC_CH7_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024818u)
/** Alias (User Manual Name) for EDSADC_CH7_FCNTC.
* To use register names with standard convension, please use EDSADC_CH7_FCNTC.
*/
#define EDSADC_FCNTC7 (EDSADC_CH7_FCNTC)

/** \brief 81C, Overshoot Compensation Cfg. Register 7 */
#define EDSADC_CH7_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF002481Cu)
/** Alias (User Manual Name) for EDSADC_CH7_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH7_OVSCFG.
*/
#define EDSADC_OVSCFG7 (EDSADC_CH7_OVSCFG)

/** \brief 820, Integration Window Control Register 7 */
#define EDSADC_CH7_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024820u)
/** Alias (User Manual Name) for EDSADC_CH7_IWCTR.
* To use register names with standard convension, please use EDSADC_CH7_IWCTR.
*/
#define EDSADC_IWCTR7 (EDSADC_CH7_IWCTR)

/** \brief 824, Intermediate Integration Value */
#define EDSADC_CH7_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024824u)
/** Alias (User Manual Name) for EDSADC_CH7_IIVAL.
* To use register names with standard convension, please use EDSADC_CH7_IIVAL.
*/
#define EDSADC_IIVAL7 (EDSADC_CH7_IIVAL)

/** \brief 828, Integrator Status Register 7 */
#define EDSADC_CH7_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024828u)
/** Alias (User Manual Name) for EDSADC_CH7_ISTAT.
* To use register names with standard convension, please use EDSADC_CH7_ISTAT.
*/
#define EDSADC_ISTAT7 (EDSADC_CH7_ISTAT)

/** \brief 82C, Result FIFO Control Register 7 */
#define EDSADC_CH7_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002482Cu)
/** Alias (User Manual Name) for EDSADC_CH7_RFC.
* To use register names with standard convension, please use EDSADC_CH7_RFC.
*/
#define EDSADC_RFC7 (EDSADC_CH7_RFC)

/** \brief 830, Result Register 7 Main */
#define EDSADC_CH7_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024830u)
/** Alias (User Manual Name) for EDSADC_CH7_RESM.
* To use register names with standard convension, please use EDSADC_CH7_RESM.
*/
#define EDSADC_RESM7 (EDSADC_CH7_RESM)

/** \brief 838, Offset Compensation Register 7 */
#define EDSADC_CH7_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024838u)
/** Alias (User Manual Name) for EDSADC_CH7_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH7_OFFCOMP.
*/
#define EDSADC_OFFCOMP7 (EDSADC_CH7_OFFCOMP)

/** \brief 83C, Gain Calibration Register 7 */
#define EDSADC_CH7_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002483Cu)
/** Alias (User Manual Name) for EDSADC_CH7_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH7_GAINCAL.
*/
#define EDSADC_GAINCAL7 (EDSADC_CH7_GAINCAL)

/** \brief 840, Gain Control Register 7 */
#define EDSADC_CH7_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024840u)
/** Alias (User Manual Name) for EDSADC_CH7_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH7_GAINCTR.
*/
#define EDSADC_GAINCTR7 (EDSADC_CH7_GAINCTR)

/** \brief 844, Gain Correction Register 7 */
#define EDSADC_CH7_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024844u)
/** Alias (User Manual Name) for EDSADC_CH7_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH7_GAINCORR.
*/
#define EDSADC_GAINCORR7 (EDSADC_CH7_GAINCORR)

/** \brief 850, Time-Stamp Register 7 */
#define EDSADC_CH7_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024850u)
/** Alias (User Manual Name) for EDSADC_CH7_TSTMP.
* To use register names with standard convension, please use EDSADC_CH7_TSTMP.
*/
#define EDSADC_TSTMP7 (EDSADC_CH7_TSTMP)

/** \brief 854, Time-Stamp Counter 7 */
#define EDSADC_CH7_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024854u)
/** Alias (User Manual Name) for EDSADC_CH7_TSCNT.
* To use register names with standard convension, please use EDSADC_CH7_TSCNT.
*/
#define EDSADC_TSCNT7 (EDSADC_CH7_TSCNT)

/** \brief 870, Auxiliary Filter Configuration Register 7 */
#define EDSADC_CH7_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024870u)
/** Alias (User Manual Name) for EDSADC_CH7_FCFGA.
* To use register names with standard convension, please use EDSADC_CH7_FCFGA.
*/
#define EDSADC_FCFGA7 (EDSADC_CH7_FCFGA)

