Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEdsadc_reg.h
/** \brief 944, Gain Correction Register 8 */
#define EDSADC_CH8_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024944u)
/** Alias (User Manual Name) for EDSADC_CH8_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH8_GAINCORR.
*/
#define EDSADC_GAINCORR8 (EDSADC_CH8_GAINCORR)

/** \brief 950, Time-Stamp Register 8 */
#define EDSADC_CH8_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024950u)
/** Alias (User Manual Name) for EDSADC_CH8_TSTMP.
* To use register names with standard convension, please use EDSADC_CH8_TSTMP.
*/
#define EDSADC_TSTMP8 (EDSADC_CH8_TSTMP)

/** \brief 954, Time-Stamp Counter 8 */
#define EDSADC_CH8_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024954u)
/** Alias (User Manual Name) for EDSADC_CH8_TSCNT.
* To use register names with standard convension, please use EDSADC_CH8_TSCNT.
*/
#define EDSADC_TSCNT8 (EDSADC_CH8_TSCNT)

/** \brief 970, Auxiliary Filter Configuration Register 8 */
#define EDSADC_CH8_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024970u)
/** Alias (User Manual Name) for EDSADC_CH8_FCFGA.
* To use register names with standard convension, please use EDSADC_CH8_FCFGA.
*/
#define EDSADC_FCFGA8 (EDSADC_CH8_FCFGA)

/** \brief 978, Boundary Select Register 8 */
#define EDSADC_CH8_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024978u)
/** Alias (User Manual Name) for EDSADC_CH8_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH8_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL8 (EDSADC_CH8_BOUNDSEL)

/** \brief 980, Result Register 8 Auxiliary */
#define EDSADC_CH8_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024980u)
/** Alias (User Manual Name) for EDSADC_CH8_RESA.
* To use register names with standard convension, please use EDSADC_CH8_RESA.
*/
#define EDSADC_RESA8 (EDSADC_CH8_RESA)

/** \brief 9A0, Carrier Generator Synchronization Reg. 8 */
#define EDSADC_CH8_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00249A0u)
/** Alias (User Manual Name) for EDSADC_CH8_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH8_CGSYNC.
*/
#define EDSADC_CGSYNC8 (EDSADC_CH8_CGSYNC)

/** \brief 9A8, Rectification Configuration Register 8 */
#define EDSADC_CH8_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00249A8u)
/** Alias (User Manual Name) for EDSADC_CH8_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH8_RECTCFG.
*/
#define EDSADC_RECTCFG8 (EDSADC_CH8_RECTCFG)

/** \brief 9B0, Common Mode Voltage Register 8 */
#define EDSADC_CH8_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00249B0u)
/** Alias (User Manual Name) for EDSADC_CH8_VCM.
* To use register names with standard convension, please use EDSADC_CH8_VCM.
*/
#define EDSADC_VCM8 (EDSADC_CH8_VCM)

/** \brief A00, Modulator Configuration Register 9 */
#define EDSADC_CH9_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024A00u)
/** Alias (User Manual Name) for EDSADC_CH9_MODCFG.
* To use register names with standard convension, please use EDSADC_CH9_MODCFG.
*/
#define EDSADC_MODCFG9 (EDSADC_CH9_MODCFG)

/** \brief A08, Demodulator Input Config. Register 9 */
#define EDSADC_CH9_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024A08u)
/** Alias (User Manual Name) for EDSADC_CH9_DICFG.
* To use register names with standard convension, please use EDSADC_CH9_DICFG.
*/
#define EDSADC_DICFG9 (EDSADC_CH9_DICFG)

/** \brief A10, Filter Configuration Register 9, Main */
#define EDSADC_CH9_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024A10u)
/** Alias (User Manual Name) for EDSADC_CH9_FCFGM.
* To use register names with standard convension, please use EDSADC_CH9_FCFGM.
*/
#define EDSADC_FCFGM9 (EDSADC_CH9_FCFGM)

/** \brief A14, Filter Configuration Register 9, CIC Filter */
#define EDSADC_CH9_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024A14u)
/** Alias (User Manual Name) for EDSADC_CH9_FCFGC.
* To use register names with standard convension, please use EDSADC_CH9_FCFGC.
*/
#define EDSADC_FCFGC9 (EDSADC_CH9_FCFGC)

/** \brief A18, Filter Counter Register 9, CIC Filter */
#define EDSADC_CH9_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024A18u)
/** Alias (User Manual Name) for EDSADC_CH9_FCNTC.
* To use register names with standard convension, please use EDSADC_CH9_FCNTC.
*/
#define EDSADC_FCNTC9 (EDSADC_CH9_FCNTC)

/** \brief A1C, Overshoot Compensation Cfg. Register 9 */
#define EDSADC_CH9_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF0024A1Cu)
/** Alias (User Manual Name) for EDSADC_CH9_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH9_OVSCFG.
*/
#define EDSADC_OVSCFG9 (EDSADC_CH9_OVSCFG)

/** \brief A20, Integration Window Control Register 9 */
#define EDSADC_CH9_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024A20u)
/** Alias (User Manual Name) for EDSADC_CH9_IWCTR.
* To use register names with standard convension, please use EDSADC_CH9_IWCTR.
*/
#define EDSADC_IWCTR9 (EDSADC_CH9_IWCTR)

/** \brief A24, Intermediate Integration Value */
#define EDSADC_CH9_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024A24u)
/** Alias (User Manual Name) for EDSADC_CH9_IIVAL.
* To use register names with standard convension, please use EDSADC_CH9_IIVAL.
*/
#define EDSADC_IIVAL9 (EDSADC_CH9_IIVAL)

/** \brief A28, Integrator Status Register 9 */
#define EDSADC_CH9_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024A28u)
/** Alias (User Manual Name) for EDSADC_CH9_ISTAT.
* To use register names with standard convension, please use EDSADC_CH9_ISTAT.
*/
#define EDSADC_ISTAT9 (EDSADC_CH9_ISTAT)

/** \brief A2C, Result FIFO Control Register 9 */
#define EDSADC_CH9_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024A2Cu)
/** Alias (User Manual Name) for EDSADC_CH9_RFC.
* To use register names with standard convension, please use EDSADC_CH9_RFC.
*/
#define EDSADC_RFC9 (EDSADC_CH9_RFC)

/** \brief A30, Result Register 9 Main */
#define EDSADC_CH9_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024A30u)
/** Alias (User Manual Name) for EDSADC_CH9_RESM.
* To use register names with standard convension, please use EDSADC_CH9_RESM.
*/
#define EDSADC_RESM9 (EDSADC_CH9_RESM)

/** \brief A38, Offset Compensation Register 9 */
#define EDSADC_CH9_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024A38u)
/** Alias (User Manual Name) for EDSADC_CH9_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH9_OFFCOMP.
*/
#define EDSADC_OFFCOMP9 (EDSADC_CH9_OFFCOMP)

/** \brief A3C, Gain Calibration Register 9 */
#define EDSADC_CH9_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024A3Cu)
/** Alias (User Manual Name) for EDSADC_CH9_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH9_GAINCAL.
*/
#define EDSADC_GAINCAL9 (EDSADC_CH9_GAINCAL)

/** \brief A40, Gain Control Register 9 */
#define EDSADC_CH9_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024A40u)
/** Alias (User Manual Name) for EDSADC_CH9_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH9_GAINCTR.
*/
#define EDSADC_GAINCTR9 (EDSADC_CH9_GAINCTR)

/** \brief A44, Gain Correction Register 9 */
#define EDSADC_CH9_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024A44u)
/** Alias (User Manual Name) for EDSADC_CH9_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH9_GAINCORR.
*/
#define EDSADC_GAINCORR9 (EDSADC_CH9_GAINCORR)

/** \brief A50, Time-Stamp Register 9 */
#define EDSADC_CH9_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024A50u)
/** Alias (User Manual Name) for EDSADC_CH9_TSTMP.
* To use register names with standard convension, please use EDSADC_CH9_TSTMP.
*/
#define EDSADC_TSTMP9 (EDSADC_CH9_TSTMP)

/** \brief A54, Time-Stamp Counter 9 */
#define EDSADC_CH9_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024A54u)
/** Alias (User Manual Name) for EDSADC_CH9_TSCNT.
* To use register names with standard convension, please use EDSADC_CH9_TSCNT.
*/
#define EDSADC_TSCNT9 (EDSADC_CH9_TSCNT)

