Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEdsadc_reg.h
/** \brief A70, Auxiliary Filter Configuration Register 9 */
#define EDSADC_CH9_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024A70u)
/** Alias (User Manual Name) for EDSADC_CH9_FCFGA.
* To use register names with standard convension, please use EDSADC_CH9_FCFGA.
*/
#define EDSADC_FCFGA9 (EDSADC_CH9_FCFGA)

/** \brief A78, Boundary Select Register 9 */
#define EDSADC_CH9_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024A78u)
/** Alias (User Manual Name) for EDSADC_CH9_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH9_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL9 (EDSADC_CH9_BOUNDSEL)

/** \brief A80, Result Register 9 Auxiliary */
#define EDSADC_CH9_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024A80u)
/** Alias (User Manual Name) for EDSADC_CH9_RESA.
* To use register names with standard convension, please use EDSADC_CH9_RESA.
*/
#define EDSADC_RESA9 (EDSADC_CH9_RESA)

/** \brief AA0, Carrier Generator Synchronization Reg. 9 */
#define EDSADC_CH9_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024AA0u)
/** Alias (User Manual Name) for EDSADC_CH9_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH9_CGSYNC.
*/
#define EDSADC_CGSYNC9 (EDSADC_CH9_CGSYNC)

/** \brief AA8, Rectification Configuration Register 9 */
#define EDSADC_CH9_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024AA8u)
/** Alias (User Manual Name) for EDSADC_CH9_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH9_RECTCFG.
*/
#define EDSADC_RECTCFG9 (EDSADC_CH9_RECTCFG)

/** \brief AB0, Common Mode Voltage Register 9 */
#define EDSADC_CH9_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024AB0u)
/** Alias (User Manual Name) for EDSADC_CH9_VCM.
* To use register names with standard convension, please use EDSADC_CH9_VCM.
*/
#define EDSADC_VCM9 (EDSADC_CH9_VCM)

/** \brief B00, Modulator Configuration Register 10 */
#define EDSADC_CH10_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024B00u)
/** Alias (User Manual Name) for EDSADC_CH10_MODCFG.
* To use register names with standard convension, please use EDSADC_CH10_MODCFG.
*/
#define EDSADC_MODCFG10 (EDSADC_CH10_MODCFG)

/** \brief B08, Demodulator Input Config. Register 10 */
#define EDSADC_CH10_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024B08u)
/** Alias (User Manual Name) for EDSADC_CH10_DICFG.
* To use register names with standard convension, please use EDSADC_CH10_DICFG.
*/
#define EDSADC_DICFG10 (EDSADC_CH10_DICFG)

/** \brief B10, Filter Configuration Register 10, Main */
#define EDSADC_CH10_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024B10u)
/** Alias (User Manual Name) for EDSADC_CH10_FCFGM.
* To use register names with standard convension, please use EDSADC_CH10_FCFGM.
*/
#define EDSADC_FCFGM10 (EDSADC_CH10_FCFGM)

/** \brief B14, Filter Configuration Register 10, CIC Filter */
#define EDSADC_CH10_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024B14u)
/** Alias (User Manual Name) for EDSADC_CH10_FCFGC.
* To use register names with standard convension, please use EDSADC_CH10_FCFGC.
*/
#define EDSADC_FCFGC10 (EDSADC_CH10_FCFGC)

/** \brief B18, Filter Counter Register 10, CIC Filter */
#define EDSADC_CH10_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024B18u)
/** Alias (User Manual Name) for EDSADC_CH10_FCNTC.
* To use register names with standard convension, please use EDSADC_CH10_FCNTC.
*/
#define EDSADC_FCNTC10 (EDSADC_CH10_FCNTC)

/** \brief B1C, Overshoot Compensation Cfg. Register 10 */
#define EDSADC_CH10_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF0024B1Cu)
/** Alias (User Manual Name) for EDSADC_CH10_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH10_OVSCFG.
*/
#define EDSADC_OVSCFG10 (EDSADC_CH10_OVSCFG)

/** \brief B20, Integration Window Control Register 10 */
#define EDSADC_CH10_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024B20u)
/** Alias (User Manual Name) for EDSADC_CH10_IWCTR.
* To use register names with standard convension, please use EDSADC_CH10_IWCTR.
*/
#define EDSADC_IWCTR10 (EDSADC_CH10_IWCTR)

/** \brief B24, Intermediate Integration Value */
#define EDSADC_CH10_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024B24u)
/** Alias (User Manual Name) for EDSADC_CH10_IIVAL.
* To use register names with standard convension, please use EDSADC_CH10_IIVAL.
*/
#define EDSADC_IIVAL10 (EDSADC_CH10_IIVAL)

/** \brief B28, Integrator Status Register 10 */
#define EDSADC_CH10_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024B28u)
/** Alias (User Manual Name) for EDSADC_CH10_ISTAT.
* To use register names with standard convension, please use EDSADC_CH10_ISTAT.
*/
#define EDSADC_ISTAT10 (EDSADC_CH10_ISTAT)

/** \brief B2C, Result FIFO Control Register 10 */
#define EDSADC_CH10_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024B2Cu)
/** Alias (User Manual Name) for EDSADC_CH10_RFC.
* To use register names with standard convension, please use EDSADC_CH10_RFC.
*/
#define EDSADC_RFC10 (EDSADC_CH10_RFC)

/** \brief B30, Result Register 10 Main */
#define EDSADC_CH10_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024B30u)
/** Alias (User Manual Name) for EDSADC_CH10_RESM.
* To use register names with standard convension, please use EDSADC_CH10_RESM.
*/
#define EDSADC_RESM10 (EDSADC_CH10_RESM)

/** \brief B38, Offset Compensation Register 10 */
#define EDSADC_CH10_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024B38u)
/** Alias (User Manual Name) for EDSADC_CH10_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH10_OFFCOMP.
*/
#define EDSADC_OFFCOMP10 (EDSADC_CH10_OFFCOMP)

/** \brief B3C, Gain Calibration Register 10 */
#define EDSADC_CH10_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024B3Cu)
/** Alias (User Manual Name) for EDSADC_CH10_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH10_GAINCAL.
*/
#define EDSADC_GAINCAL10 (EDSADC_CH10_GAINCAL)

/** \brief B40, Gain Control Register 10 */
#define EDSADC_CH10_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024B40u)
/** Alias (User Manual Name) for EDSADC_CH10_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH10_GAINCTR.
*/
#define EDSADC_GAINCTR10 (EDSADC_CH10_GAINCTR)

/** \brief B44, Gain Correction Register 10 */
#define EDSADC_CH10_GAINCORR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024B44u)
/** Alias (User Manual Name) for EDSADC_CH10_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH10_GAINCORR.
*/
#define EDSADC_GAINCORR10 (EDSADC_CH10_GAINCORR)

/** \brief B50, Time-Stamp Register 10 */
#define EDSADC_CH10_TSTMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024B50u)
/** Alias (User Manual Name) for EDSADC_CH10_TSTMP.
* To use register names with standard convension, please use EDSADC_CH10_TSTMP.
*/
#define EDSADC_TSTMP10 (EDSADC_CH10_TSTMP)

/** \brief B54, Time-Stamp Counter 10 */
#define EDSADC_CH10_TSCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024B54u)
/** Alias (User Manual Name) for EDSADC_CH10_TSCNT.
* To use register names with standard convension, please use EDSADC_CH10_TSCNT.
*/
#define EDSADC_TSCNT10 (EDSADC_CH10_TSCNT)

/** \brief B70, Auxiliary Filter Configuration Register 10 */
#define EDSADC_CH10_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024B70u)
/** Alias (User Manual Name) for EDSADC_CH10_FCFGA.
* To use register names with standard convension, please use EDSADC_CH10_FCFGA.
*/
#define EDSADC_FCFGA10 (EDSADC_CH10_FCFGA)

/** \brief B78, Boundary Select Register 10 */
#define EDSADC_CH10_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024B78u)
/** Alias (User Manual Name) for EDSADC_CH10_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH10_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL10 (EDSADC_CH10_BOUNDSEL)

/** \brief B80, Result Register 10 Auxiliary */
#define EDSADC_CH10_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024B80u)
/** Alias (User Manual Name) for EDSADC_CH10_RESA.
* To use register names with standard convension, please use EDSADC_CH10_RESA.
*/
#define EDSADC_RESA10 (EDSADC_CH10_RESA)

/** \brief BA0, Carrier Generator Synchronization Reg. 10 */
#define EDSADC_CH10_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024BA0u)
/** Alias (User Manual Name) for EDSADC_CH10_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH10_CGSYNC.
*/
#define EDSADC_CGSYNC10 (EDSADC_CH10_CGSYNC)

/** \brief BA8, Rectification Configuration Register 10 */
#define EDSADC_CH10_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024BA8u)
/** Alias (User Manual Name) for EDSADC_CH10_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH10_RECTCFG.
*/
#define EDSADC_RECTCFG10 (EDSADC_CH10_RECTCFG)

/** \brief BB0, Common Mode Voltage Register 10 */
#define EDSADC_CH10_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024BB0u)
/** Alias (User Manual Name) for EDSADC_CH10_VCM.
* To use register names with standard convension, please use EDSADC_CH10_VCM.
*/
#define EDSADC_VCM10 (EDSADC_CH10_VCM)

/** \brief C00, Modulator Configuration Register 11 */
#define EDSADC_CH11_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024C00u)
/** Alias (User Manual Name) for EDSADC_CH11_MODCFG.
* To use register names with standard convension, please use EDSADC_CH11_MODCFG.
*/
#define EDSADC_MODCFG11 (EDSADC_CH11_MODCFG)

